// TODO: ...???
function getQueryParam(item) {
    let regex = new RegExp('[\?\&]' + item + '=([^\&]*)(\&?)', 'i');
    var value = window.location.search.match(regex);
    return value ? value[1] : null;
}

let link = getQueryParam('link') || null;
console.log('link:', link);
if (link) {
    axios.get('/api/container', {
        params: {
            where: `{"link":"${link}"}`
        }
    })
        .then(function (resp) {
            console.log(resp);
            if (resp) {

                let json = resp['data']['_items'][0]['data'];
                // console.log(json);

                let data = JSON.parse(json);
                console.log(data);

                data.forEach(function (item) {
                    let other = item[3];
                    if (typeof other === 'string') {
                        other = JSON.parse(item[3]);
                    }
                    console.log(other);
                });

            }
        })
        .catch(function (err) {
            console.log(err);
        })
        .then(function () {
            //
        });
}

// let res = '[["туристский продукт",4],["туроператоры",2],["реализация",2],["продвижение",2],["смена статуса компаний",1],["российский союз туриндустрии",1],["правовое регулирование взаимоотношений",1],["федеральное агентство",1],["туроператорская деятельность",1],["туристский обслуживание",1],["туристские агентства",1],["туристская путёвка",1],["туристический бизнес",1],["туристические агентства",1],["турагентская деятельность",1],["страховые компании",1],["страховой случай",1],["страховой полисы",1],["страховой возмещение",1],["статус туроператора",1],["статус турагентства",1],["средства обслуживания",1],["российская федерация",1],["российская ассоциация",1],["реализующая турпродукт",1],["проданный туроператор",1],["приобретший турпродукт",1],["подобное турагент",1],["осуществляющие реализация",1],["конечный потребители",1],["закрепляющий деятельность",1],["законодательное запрет",1],["действующий законодательство",1],["бывший туроператор",1],["формирование",1],["туристы",1],["турист",1],["туризм",1],["турагенты",1],["турагент",1],["трудности",1],["сфера",1],["ситуация",1],["сила",1],["сайт",1],["россия",1],["рата",1],["проблемы",1],["предприятие",1],["практика",1],["потребитель",1],["посредники",1],["получение",1],["покупатель",1],["отсутствие",1],["ответственность",1],["наступление",1],["компания",1],["законодательство",1]]';

//